Revit 2027 API
BoundaryConditions.CreateLineBoundaryConditions Method
Overload List
Name | Description
CreateLineBoundaryConditions(Document, Reference, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double) |  Creates a new hosted line boundary conditions within the project.
CreateLineBoundaryConditions(Document, ElementId, Curve, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double) |  Creates a new custom line boundary conditions within the project.
Top
See Also
Reference
BoundaryConditions Class
Autodesk.Revit.DB.Structure Namespace